---
kind: method
id: M:Autodesk.Revit.UI.ComboBoxData.#ctor(System.String)
source: html/bf6dd61c-078e-86e8-65d4-99f5de3e402d.htm
---
# Autodesk.Revit.UI.ComboBoxData.#ctor Method

Constructs a new instance of ComboBoxData.

## Syntax (C#)
```csharp
public ComboBoxData(
	string name
)
```

## Parameters
- **name** (`System.String`) - The internal name of the ComboBoxMember.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when Nothing nullptr a null reference ( Nothing in Visual Basic) is passed for name.
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when an empty string is passed for name.